app/Controllers/Home.php

    function checkRegistrasi()
    {
        $noreg = $this->request->getGet('noreg');
        $data = $this->siswa->where('noreg', $noreg)->first();
---
SELECT *
FROM `siswa`
WHERE `noreg` = '08255936'
 LIMIT 1

    function BuktiTf()
    {
        $file = $this->request->getFile('bukti');
        $data = array(
            'noreg' => $this->request->getPost('par1'),
            'tgl_lahir' => $this->request->getPost('par2')
        );
        if ($file->isValid()){
            if (
                $this->siswa
                ->where('noreg', $data['noreg'])
                ->where('tgl_lahir', $data['tgl_lahir'])->first() != null
            ) {
                // $ext = $file->getClientExtension();
                $newName = $file->getRandomName();
                $file->move('uploads/buktitf', $newName);
                $this->siswa->where('noreg', $data['noreg'])->set('bukti_tf', $newName)->update();
                $this->siswa->where('noreg', $data['noreg'])->set('stage', 1)->update();
---
SELECT *
FROM `siswa`
WHERE `noreg` = '08255936'
AND `tgl_lahir` = '2024-08-01'
 LIMIT 1
UPDATE `siswa` SET `bukti_tf` = '1752979870_ee996dc94618f91992ab.jpeg', `updated_at` = '2025-07-20 02:51:10'
WHERE `noreg` = '08255936'
UPDATE `siswa` SET `stage` = 2, `updated_at` = '2025-07-20 02:51:10'
WHERE `noreg` = '08255936'

    function dashboard()
    {
        $data = array(
            // 'session' => session()->get(),
            'record' => $this->siswa->findAll()
        );
---
SELECT *
FROM `siswa`

    public function Detail($id)
    {
        $siswa_0 = $this->siswa->where('id', $id)->first();
---
SELECT *
FROM `siswa`
WHERE `id` = '59'
 LIMIT 1

    function getProvinsi()
    {
        return json_encode($this->provinsi->findAll());
---
SELECT *
FROM `t_provinsi`

    function getJalur($id = null, $nama = null)
    {
        $db = \Config\Database::connect();
        if ($id == null) {
            $query = $db->table('jalur')
                ->select('nama')
                ->select('id')
                ->where('enable', 1)
                ->get();
---
SELECT `nama`, `id`
FROM `jalur`
WHERE `enable` = 1

    function getTahun($id = null, $nama = null)
    {
        $db = \Config\Database::connect();
        if ($id == null) {
            $query = $db->table('tahunajar')
                ->select('nama')
                ->select('id')
                ->where('enable', 1)
                ->get();
---
SELECT `nama`, `id`
FROM `tahunajar`
WHERE `enable` = 1

    function prov($id)
    {
        $db = \Config\Database::connect();
        $query = $db->table('t_provinsi')
            ->select('nama')
            ->where('id', $id)
            ->get();

        $result = $query->getRow();
---
SELECT `nama`
FROM `t_provinsi`
WHERE `id` = '14'