app/Controllers/Home.php

SELECT *
FROM `siswa`
WHERE `noreg` = '07210936'
 LIMIT 1
---
    function checkRegistrasi()
    {
        $noreg = $this->request->getPost('noreg');
        $data = $this->siswa->where('noreg', $noreg)->first();