app/Controllers/Home.php

    public function Detail($id)
    {
        $siswa_0 = $this->siswa->where('id', $id)->first();
---
SELECT *
FROM `siswa`
WHERE `id` = '59'
 LIMIT 1

    function getProvinsi()
    {
        return json_encode($this->provinsi->findAll());
---
SELECT *
FROM `t_provinsi`

    function getJalur($id = null, $nama = null)
    {
        $db = \Config\Database::connect();
        if ($id == null) {
            $query = $db->table('jalur')
                ->select('nama')
                ->select('id')
                ->where('enable', 1)
                ->get();

            $result = $query->getResultArray();
---
SELECT *
FROM `jalur`

    function getTahun($id = null, $nama = null)
    {
        $db = \Config\Database::connect();
        if ($id == null) {
            $query = $db->table('tahunajar')
                ->select('nama')
                ->select('id')
                ->where('enable', 1)
                ->get();

            $result = $query->getResultArray();
---
SELECT `nama`, `id`
FROM `tahunajar`
WHERE `enable` = 1

    function prov($id)
    {
        $db = \Config\Database::connect();
        $query = $db->table('t_provinsi')
            ->select('nama')
            ->where('id', $id)
            ->get();

        $result = $query->getRow();
---
SELECT `nama`
FROM `t_provinsi`
WHERE `id` = '11'
SELECT `nama`
FROM `t_provinsi`
WHERE `id` = '14'